# ამოცანა 1.
# მოცემულია მასივი, საიდანაც ამოიღებთ მინიმალურ ციფრს/რიცხვს.
# თუ ამ მასივში არის ორი ან მეტი ერთნაირი მინიმალური ციფრი/რიცხვი,
# მაშინ ამოაგდეთ ის მინიმალური, რომლის ინდექსიც უფრო ნაკლებია.

# Input: [1,2,3,4,5], output = [2,3,4,5]
# Input: [5,3,2,1,4], output = [5,3,2,4]
# Input: [2,2,1,2,1], output = [2,2,2,1]




# 
# ამოცანა 4.

# შექმენით ფუნქცია, რომლის საშუალებითაც მასივში მხოლოდ იმ ელემენტების
# ჯამს შეკრიბავთ, რომლებიც მხოლოდ ერთხელ მეორდება.

# test case -- ([4,5,7,5,4,8]),15)
# test case -- ([9, 10, 19, 13, 19, 13]),19)

# -------------------------------------------------------------



# ამოცანა 5.

# შექმენით ფუნქცია, რომელიც სტრინგში ამოიღებს 
# მაქსიმალურ და მინიმალურ რიცხვებს.

# test case -- ("8 3 -5 42 -1 0 0 -9 4 7 4 -4"), "42 -9")
# test case -- ("1 2 3"), "3 1")

# list = (1,5,9,2,3,-9)

# def function(max,min):


# ამოცანა 8.
# შექმენით ფუნქცია, რომლის საშუალებითაც გადაიტანთ
#  0-ებს მასივის ბოლო ინდექსებზე.
# მაგალითად --- ([1, 0, 1, 2, 0, 1, 3]) => [1, 1, 2, 1, 3, 0, 0]

# test case -- [1, 2, 0, 1, 0, 1, 0, 3, 0, 1]),  [1, 2, 1, 1, 3, 1, 0, 0, 0, 0])
# test case -- [9, 0, 0, 9, 1, 2, 0, 1, 0, 1, 0, 3, 0, 1, 9, 0, 0, 0, 0, 9]), [9, 9, 1, 2, 1, 1, 3, 1, 9, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

# --------------------------------------------------------------------
    
list = [1,0,1,2,0,1,3]

def function(list):
    list.remove([1,4])
    list.append([0,0])
function(list([1, 2, 0, 4, 0, 5]))